<script setup>

</script>

<template>
<div>
  发布时间：2019年 7 月 22日
  生效时间：2019年 7 月 22日
  更新时间：2022年03月29日
  隐私政策
  CSDN是一个面向中国软件和软件人的综合社区网站，是一个中文IT社区和开发技术服务平台，是为中国的软件开发者、IT从业者及其他人员提供技术交流及信息存储空间服务的平台。CSDN非常重视用户的隐私，非常感谢您的信任，选择CSDN为您提供服务。为更好地保障用户隐私，CSDN特别从如下几方面对您在使用 CSDN服务过程中，我们是如何收集、使用、存储、分享您的个人信息，以及我们为您提供的访问、更新、删除和保护这些信息的方式做出如下具体说明。

  一、CSDN可能收集的信息内容

  二、CSDN收集信息的使用规则

  三、CSDN如何共享、转让、公开披露您的个人信息

  四、CSDN如何使用Cookie 和同类技术

  五、CSDN如何保护和保存您的个人信息

  六、您如何管理个人信息

  七、未成年人信息的保护

  八、隐私政策的修订和更新

  九、如何联系我们



  请您在使用CSDN所有产品及服务前，仔细阅读本隐私政策，并确定了解我们对您个人信息的收集、处理等规则。如您不同意本隐私政策的任何条款，请立即停止注册及使用CSDN相关产品或服务，如您选择继续注册或使用CSDN相关产品或服务，即代表您认可并接受本隐私政策的全部内容。



  一、CSDN可能收集的信息内容

  CSDN收集的个人信息主要包括您注册时提供的个人信息以及在使用CSDN相关产品即服务过程中授权CSDN获取的信息以及第三方分享有关您的信息。 个人信息指您的姓名、证件号码、联系方式、住址、账号密码、财产状况、行踪轨迹等 ，以电子或者其他方式记录的能够单独或者与其他信息结合识别您身份或者反映您活动情况的各种信息 。

  1.1主动提供的信息

  （1）您在注册或使用CSDN产品及服务过程中，您主动提供的姓名、证件号码、手机号、电子邮箱信息。您选择使用第三方账号登陆时，CSDN会收集您微信、QQ、微博、AppleID的第三方账号、图像、昵称信息。

  （2）您在使用CSDN产品及服务过程中上传的姓名、住址、证件号码、手机号、电子邮箱信息。

  （3） 您在参加CSDN举办的线上及线下活动过程中提供的姓名、手机号、微信、QQ信息 。

  1.2我们如何收集和使用个人信息

  我们会按照如下方式收集您在使用服务时主动提供的，以及通过自动化手段收集您在使用功能或接受服务过程中产生的信息：

  （1）开展内部数据分析和研究，第三方SDK统计服务，改善我们的产品或服务

  我们收集数据是根据您与我们的互动和您所做出的选择，包括您的隐私设置以及您使用的产品和功能。我们收集的数据可能包括SDK/API/JS代码版本、浏览器、互联网服务提供商、IP地址、平台、时间戳、应用标识符、应用程序版本、应用分发渠道、独立设备标识符、iOS广告标识符（IDFA)、安卓广告主标识符、网卡（MAC）地址、国际移动设备识别码（IMEI）、设备型号、终端制造厂商、终端设备操作系统版本、 会话启动/停止时间、语言所在地、时区和网络状态（WiFi等） 、硬盘、CPU和电池使用情况等。

  当我们要将信息用于本策略未载明的其它用途时，会事先征求您的同意。

  当我们要将基于特定目的收集而来的信息用于其他目的时，会事先征求您的同意。

  (2)注册、登录、认证、找回

  ① 注册、登录

  a. 当您注册、登录CSDN及相关服务时，您可以通过手机号创建帐号，并且您可以完善相关的网络身份识别信息（头像、昵称、密码），收集这些信息是为了帮助您完成注册。您还可以根据自身需求选择填写性别、生日、地区及个人介绍来完善您的信息。

  在您访问我们应用程序或网页时，虽然您可匿名浏览、搜索，但您需要注册成为平台用户后才能使用发布、评论及其他用户服务。

  b. 您也可以使用第三方帐号登录并使用，您将授权我们获取您在第三方平台注册的公开信息（头像、昵称以及您授权的其他信息），用于与CSDN帐号绑定，使您可以直接登录并使用本产品和相关服务，我们将在您授权同意的范围内使用您的相关信息。此外，我们可能经您同意后向第三方共享您的帐号信息（头像、昵称及其他页面提示的信息），便于您方便实现第三方帐号的注册或第三方帐号的登录。

  c.基于我们与通信运营商的合作，当您使用CSDN“一键登录”功能时，经过您的明示同意，运营商会将您的手机号码发送给我们，便于我们为您提供快捷的登录服务。您也可以自主选择手动填写手机号码的方式完成注册或登录。 手机号码属于个人敏感信息 ，如果拒绝提供将无法使用“一键登录”方式注册登录CSDN，但不影响你通过其他方式注册登录，也不影响其他功能的正常使用。

  ② 认证

  在您使用身份认证的功能或服务时，根据相关法律法规，您可能需要提供您的真实身份信息（ 真实姓名、身份证号码、电话号码 ）以完成实名验证，特别且必要情况下基于安全考虑，为了确保我们为您本人提供服务，我们可能会根据您提供的信息进行校验。 这些信息属于个人敏感信息，您可以拒绝提供，但您将可能无法获得相关服务，但不影响其他功能与服务的正常使用。

  ③ 帐号找回

  您可以通过找回帐号功能对您的帐号进行找回，为保障您帐号的安全所必需，在找回帐号时我们可能需要您填写用邮箱、手机号以进行验证您的身份。

  (2)资讯浏览

  CSDN可能会向您推荐更感兴趣的信息，为实现这一功能，我们可能会收集必要的日志信息。

  ①用于信息展示的日志信息包括：

  a. 您操作、使用的行为信息：点击、关注、收藏、搜索、查询、浏览、下载、分享、交易

  b. 您主动提供的信息：反馈、发布、点赞、评论、编辑、性别、生日、地区、介绍

  c.  地理位置信息：含通过GPS信息、WLAN接入点、蓝牙和基站等传感器信息获取到的精确地理位置信息及通过网络位置信息（例如基站、IP及WLAN）获取的大致地理位置信息

  精确地理位置是敏感个人信息，若您拒绝提供，我们将不会根据 精确 信息向您推荐信息，且不会影响CSDN其他功能的正常使用。

  我们会基于IP地址对应的城市向您展示、推荐您所在地区的本地相关信息。

  我们收集、使用的上述信息进行了去标识化处理，数据分析仅对应特定的、无法直接关联您身份的编码，不会与您的真实身份相关联。

  您在浏览CSDN提供的内容时,如果需要保存图片,我们将会请求您的写入外置存储器权限

  广告服务

  为了便于广告商进行数据分发和统计,我们将会获取SIM卡运营商信息、android_id信息.

  （4）发布与互动

  ① 信息发布

  a.您发布内容、评论、提问或回答时，我们将收集您发布的信息，并展示您的昵称、头像、发布内容。

  b.您使用上传图片、发布音视频功能时，我们会请求您授权 相机、相册（存储空间）、照片、麦克风、读取外置存储器权限 。您如果拒绝授权提供，将无法使用此功能，但不影响您正常使用CSDN的其他功能。

  c、当用户使用直播/视频播放功能和服务时，我们需要收集您的一些信息，包括如下个人信息：设备型号、设备名称、设备标识、浏览器类型和设置、语言设置、操作系统和应用程序版本、登录IP地址、接入网络的方式、网络质量数据、网络类型、设备屏幕密度、数据链接状态、设备屏幕宽度和高度、设备屏幕像素、产品版本号、日志信息（如操作日志、服务日志）。同时为了收集上述基本的个人设备信息，我们将会申请访问您的设备信息的权限，我们收集这些信息是为了向您提供我们最核心的视频展示和播放服务.

  d.您发布信息并选择显示位置时， 我们会请求您授权地理位置权限 ，并收集与本服务相关的位置信息。 精确地理位置信息属于您的个人敏感信息 ，您如果拒绝授权提供精确地理位置信息，将无法使用此功能，但不影响您正常使用CSDN的其他功能。

  e.请注意，您公开发布的信息中可能会涉及用户或他人的个人信息，若您公开发布的信息中包含他人个人信息的，在上传发布之前，您需确保为法律法规允许使用或已获得合法授权。

  f.用户因使用我们的产品或者服 务而被我们收集 的信息，例如其他用户发布的信息中可能含有您的部分信息（如：在评论、留言、发布图文、音视频中涉及到与您相关的信息）。

  h.CSDN接入了用户推荐服务，在相关功能所必需的情况下，会向您申请通讯录权限 、获取应用账户权限，并会将通讯录中的信息进行高强度加密算法处理。 通讯录信息属于个人敏感信息 ，拒绝提供该信息仅会使您无法使用上述功能，但不影响您正常使用CSDN及相关服务的其他功能。

  ② 互动交流

  a.您主动关注您感兴趣的帐号、收藏夹、活动、话题并与之进行互动，进行浏览、评论、收藏、点赞或分享内容时，我们会收集您关注的帐号，并向您展示您关注帐号发布内容。

  b.在您分享或接收被分享的信息、参加活动等情形下，我们需要访问您的剪切板，读取其中包含的口令、分享码、链接，以实现跳转、分享、活动联动功能或服务。

  (5)消息通知

  您知悉并同意，对于您在使用产品及/或服务的过程中提供的您的联系方式（例如：邮箱、联系电话），我们在运营中可能会向其中的一种或多种发送多类通知，用于用户消息告知、身份验证、安全验证、用户使用体验调研、争议处理用途；此外，我们也可能会向在前述过程中收集的邮箱、手机号码通过短信、电话、邮件的方式，为您提供您可能感兴趣的服务、功能或活动商业性信息的用途，但请您放心，如您不愿接受这些信息，您可以通过手机短信、邮件中提供的退订方式进行退订，也可以直接与我们联系进行退订。

  (6)用户反馈与服务

  a.客服及问题：为便于与您联系、尽快帮助您解决问题或记录相关问题的处理方案及结果，我们可能会保存您与我们的通信/通话记录及相关内容（包括帐号信息、反馈信息、订单信息、您为了证明相关事实提供的其他信息，或您留下的联系方式信息），如果您针对具体订单进行咨询、投诉或提供建议的， 我们会使用您的帐号信息和订单信息。

  b.当您投诉他人或被他人投诉时，为了保护您及他人的合法权益, 我们可能会将您的帐号/身份信息、联系方式、投诉相关内容提供给消费者权益保护部门及监管机关，以便及时解决投诉纠纷，但法律法规明确禁止提供的除外。

  c.如您通过我们产品或服务使用CSDN关联方、合作方服务并进行投诉时，为便于商品/服务提供方能与您有效联系并及时处理您的投诉，您同意我们从合作方处获取您投诉时所提供的投诉内容、手机号、邮箱个人信息，并同步给对应商品/服务提供方。

  d.问卷调查：为了提供服务及改进服务质量的合理需要，我们还可能使用的您的其他信息，包括您与客服联系时您提供的手机号相关信息，您参与问卷调查时向我们发送的问卷答复信息；如您不愿，您也可以拒绝提供参与问卷调查。

  (7 ）搜索

  a、您使用搜索服务时，我们会收集您的搜索关键字信息、日志信息记录进行分析以便向您展现相关程度更高的搜索结果。搜索结果、热门搜索、相关搜索将可能跟据您的搜索/浏览、个人主页信息、日志信息进行展示。

  b、我们还可能会记录您在使用我们服务时提供、形成或留存的信息，如您在使用搜索时输入查询词,点击历史词、提示词和点击的链接，或筛选搜索范围、时间范围,以及您参与搜索运营活动时提交的信息。您有权拒绝提供上述信息,但这将导致您可能无法使用特定服务或功能,或者无法达到相关服务拟达到的效果。

  c 、搜索结果包括CSDN站内信息和第三方网站信息，当您进入第三方网站时，您的信息可能会由第三方网站收集。

  d、为了提供高效的搜索服务，部分前述信息还会暂时存储在您的本地存储设备之中，并可向您展示搜索结果内容、搜索历史记录。

  (8） 运营与安全保障

  a、运营与安全

  我们致力于为您提供安全、可信的产品与使用环境，提供优质、高效、可靠的服务与信息是我们的核心目标。

  （11）、设备信息与日志信息

  a.为了保障软件服务及您的帐号的安全、服务运营的质量及效率，我们会收集您的硬件型号、操作系统版本号、设备名称、设备配置、国际移动设备识别码、唯一设备标识符、网络设备硬件地址、IP 地址、WLAN接入点、蓝牙、软件版本号、网络接入方式、类型、状态、网络质量数据、操作、使用、服务日志。我们可能会将您的设备 信 息或电话号码与您的CSDN帐号相关联。

  b.为了预防恶意程序、保障服务安全与提升浏览体验， 我们会收集安装的应用信息或正在运行的进程信息、应用程序的总体运行、使用情况与频率、应用崩溃情况、总体安装使用情况、性能数据、应用来源。

  c.为了分析应用新增、激活、留存、性能等统计性指标，我们可能会调用剪切板对相关统计信息进行归因分析，请您放心，我们不会收集您的隐私信息。

  d.我们可能使用您的账户信息、设备信息、服务日志信息以及我们关联公司、合作方在获得您授权或依法可以共享的信息，用于判断账户安全、应用程序启动活跃与活动、进行身份验证、检测及防范安全事件。

  (9) 收集、使用个人信息目的变更

  请您了解，随着我们业务的发展，可能会对CSDN的功能和提供的服务有所调整变化。原则上，当新功能或服务与我们当前提供的功能或服务相关时，收集与使用的个人信息将与原处理目的具有直接或合理关联。在与原处理目的无直接或合理关联的场景下，我们收集、使用您的个人信息，会再次按照法律法规及国家标准的要求以页面提示、交互流程、协议确认方式另行向您进行告知说明，并征得您的同意。

  (10) 征得授权同意的例外

  请您理解，在下列情形中，根据法律法规及相关国家标准，我们收集和使用您的个人信息不必事先征得您的授权同意：

  a.与我们履行法律法规规定的义务相关的；

  b.与国家安全、国防安全直接相关的；

  c.与公共安全、公共卫生、重大公共利益直接相关的；

  d.与刑事侦查、起诉、审判和判决执行等直接相关的；

  e.出于维护您或他人的生命、财产等重大合法权益但又很难得到本人授权同意的；

  f.您自行向社会公众公开的个人信息；

  g.根据个人信息主体要求签订和履行合同所必需的；

  h.从合法公开披露的信息中收集的您的个人信息的，如合法的新闻报道、政府信息公开等渠道；

  i.用于维护软件及相关服务的安全稳定运行所必需的，例如发现、处置软件及相关服务的故障；

  j.为开展合法的新闻报道所必需的；

  k.为学术研究机构，基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；

  （11）.法律法规规定的其他情形。

  特别提示您注意，如信息无法单独或结合其他信息识别到您的个人身份，其不属于法律意义上您的个人信息；当您的信息可以单独或结合其他信息识别到您的个人身份时或我们将无法与任何特定个人信息建立联系的数据与其他您的个人信息结合使用时，这些信息在结合使用期间，将作为您的个人信息按照本隐私政策处理与保护。

  （12）.对 Cookie 和同类技术的使用

  Cookie 和同类技术是互联网中普遍使用的技术。当您使用CSDN及相关服务时，我们可能会使用相关技术向您的设备发送一个或多个 Cookie 或匿名标识符，以收集和存储您访问、使用本产品时的 用户名 、 用户登录标识  、 设备 ID  信息。我们承诺，不会将 Cookie 用于本隐私政策所述目的之外的任何其他用途。我们使用 Cookie 和同类技术主要为了实现以下功能或服务：

  ①  保障产品与服务的安全、高效运转

  我们可能会设置认证与保障安全性的 cookie 或匿名标识符，使我们确认您是否安全登录服务，或者是否遇到盗用、欺诈及其他不法行为。这些技术还会帮助我们改进服务效率，提升登录和响应速度。

  ②  帮助您获得更轻松的访问体验

  使用此类技术可以帮助您省去重复您填写个人信息、输入搜索内容的步骤和流程（示例：记录搜索、表单填写）。

  ③  为您推荐、展示、推送您可能感兴趣的内容或帐号

  3.1 我们可能会利用 Cookie 和同类技术了解您的偏好和使用习惯，进行数据分析，以改善产品服务、推荐用户感兴趣的信息或功能，并优化您对广告的选择。

  3.2 在CSDN的分享页中，我们可能会使用cookie对浏览活动进行记录，用于向您推荐信息和排查崩溃、延迟的相关异常情况以及探索更好的服务方式。

  ④ cookie的清除

  大多数浏览器均为用户提供了清除浏览器缓存数据的功能，您可以在浏览器设置功能中进行相应的数据清除操作。如您进行清除，可能因为这些修改，您可能无法使用依赖于Cookie由公司提供的服务或相应功能。

  1.3第三方SDK收集的信息

  为保障CSDN服务的相关功能的实现与应用安全稳定的运行，我们可能会接入由第三方提供的软件开发包（SDK）或类似应用程序实现相关目的。我们会对合作方获取信息的软件工具开发包（ SDK）或类似应用程序进行严格的安全评估，以保护您的个人信息安全。以下第三方SDK 将在后台状态中收集您的个人信息，收集的频次、目的以及使用用途详见下方：

  第三方SDK 名称：友盟+SDK

  用途：1、以提供统计分析服务，并通过地理位置校准报表数据准确性，提供基础反作弊能力。2、提供分享服务。3、提供反作弊服务，剔除作弊设备，排查应用性能崩溃原因。

  收集个人信息类型：设备Mac地址、唯一设备识别码（IMEI/android ID/IDFA/OPENUDID/GUID、SIM 卡 IMSI 信息）

  官网链接：https://www.umeng.com

  第三方SDK 名称：听云SDK

  用途：提供统计分析服务

  收集个人信息类型：唯一设备识别码（Android系统 IMEI/MAC地址/OAID），地理位置（经纬度）

  官网链接：https://www.tingyun.com

  第三方SDK 名称：极光推送SDK

  用途：向用户推送消息

  收集个人信息类型：设备信息：设备标识符（IMEI、IMSI、IDFA、Android ID、MAC、 OAID 等设备相关信息、应用信息:应用崩溃信息、通知开关状态、软件列表等相关信息、 设 备参 数及系统信息（设备类型、设备型号、操作系统及硬件相关信息）、网络信息: wifi等。信息 (SSID、BSSID)、位置信息: 检测是否开启获取地理位置权限.获取位置信息

  官网链接：隐私政策 - 极光

  第三方SDK 名称： OpenInstall SDKOpenInstall SDK

  用途：提供统计分析服务

  收集个人信息类型：设备信息（设备品牌，设备型号，操作系统版本）、网络信息（IP地  址）；设备标识符（IMEI、IDFA、OAID、Mac地址）

  官网链接：3.合规指南 - openinstall

  第三方SDK 名称： 阿里云视频点播SDK

  用途：提供视频点播

  收集个人信息类型：MAC地址、获取手机类型、获取网络类型、ROOT权限命令执行、获取手机号、访问外部存储卡、设置剪切板内容、获取当前连接Wi-Fi信息、获取已安装应用列表、获取设备屏幕密度、获取IMEI、唤起拨打电话页面

  官网链接：服务条款 - 视频点播 - 阿里云

  第三方SDK 名称：高德定位 SDK

  用途：用于精确定位用户位置，通过基于地理位置信息的服务

  收集个人信息类型：设备信息包括设备标识符（MEI、IDFA、OAID、Mac地址）、地理位置信息（IP地址、卫星信号）

  官网链接：高德隐私政策

  第三方SDK 名称：腾讯Bugly SDK

  用途：以提供专业的异常上报和运营统计，帮助开发者快速发现并解决异常。

  收集个人信息类型：网络类型、访问外部存储卡、获取SIM卡序列号

  官网链接：​​​​​​​腾讯 Bugly 用户协议

  第三方SDK 名称：华为推送SDK

  用途：向用户推送消息

  收集个人信息类型：设备信息包括设备标识符（MEI、IDFA、OAID、Mac地址）

  官网链接：SDK中心_开发者中心-华为云

  第三方SDK 名称：小米推送SDK

  用途：向用户推送消息

  收集个人信息类型：设备信息包括设备标识符（MEI、IDFA、OAID、Mac地址）

  官网链接：小米开放平台

  第三方SDK 名称：VIVO推送SDK

  用途：向用户推送消息

  收集个人信息类型：设备信息包括设备标识符（MEI、IDFA、OAID、Mac地址）

  官网链接：vivo开放平台

  第三方SDK 名称：腾讯移动直播SDK

  用途：以提供直播服务

  收集个人信息类型：停止录音、开始录音权限、获取SSID、获取网络类型、访问外部存储卡、获取设备屏幕密度、获取当前连接Wi-Fi信息

  官网链接：移动直播 SDK SDK 隐私协议 - 文档中心 - 腾讯云

  第三方SDK 名称：易观SDK

  用途：提供数据分析服务

  收集个人信息类型：设备属性，如操作系统，硬件版本、设备设置、IP地址、时区、设备载体、设备安装应用、设备广告标识

  官网链接：https://www.analysys.cn

  第三方SDK 名称：Open WebRTC Toolkit

  用途：提供视频分析服务

  收集个人信息类型：获取SSID、获取网络类型、访问外部存储卡、监听读取通话状态、信息、获取设备屏幕密度、获取当前连接Wi-Fi信息

  官网链接：Intel® Collaboration Suite for WebRTC

  第三方SDK 名称：阿里云实人认证SDK

  用途：以用于实现与用户的动作交互和照片采集，从而判断是否为真实用户操作、验证用户的身份，以及验证用户是否存在欺诈或作弊行为

  收集个人信息类型：访问电话状态、读取外部存储空间的文件、写入外部存储权限以及访问摄像头权限

  官网链接：安全与合规 - 实人认证 -

  第三方SDK 名称：移动一键登录SDK

  用途：一键登陆

  收集个人信息类型：设备信息包括设备标识符（MEI、IDFA、OAID、Mac地址）、收集IMSI、电话号码

  官网链接：中国移动认证隐私政策

  第三方SDK 名称：联通一键登录SDK

  用途：一键登陆

  收集个人信息类型：设备信息包括设备标识符（MEI、IDFA、OAID、Mac地址）、收集IMSI、电话号码

  官网链接：http://saas.wostore.cn

  第三方SDK 名称：电信一键登录SDK

  用途：一键登陆

  收集个人信息类型：设备信息包括设备标识符（MEI、IDFA、OAID、Mac地址）、收集IMSI、电话号码

  官网链接：https://join.e.189.cn

  第三方SDK 名称：穿山甲SDK

  用途：提供预测感兴趣的推广内容服务

  设备信息：【Android】设备品牌、型号、软件系统版本相关信息等基础信息、【iOS】设备品牌、型号、软件系统版本相关信息、手机系统重启时间、磁盘总空间、系统总内存空间、CPU数目等基础信息

  应用信息：发者应用名、应用包名、版本号、应用安装列表等信息

  其他信息：运营商信息、设备时区、设备语言

  官网链接：穿山甲SDK隐私合规指引 - 穿山甲广告平台

  第三方SDK 名称：阿里云设备风险识别SDK

  用途：提供检测篡改设备、模拟器、恶意脚本等异常设备服务

  收集个人信息类型：设备型号、操作系统版本、设备设置、MAC地址、设备识别符（IMEI、IDFA、Android ID、IMSI等）、设备环境等软件特征信息；

  官网链接：设备风险SDK Android接入 - 风险识别 - 阿里云

  第三方SDK 名称：TBS腾讯浏览服务

  用途：提供优化浏览体验的服务

  收集个人信息类型：用户的国际设备识别码（IMEI）、国际移动用户识别码（IMSI）、网卡地址（MAC Address）、用户机型、屏幕尺寸、操作系统版本号、目标API（targetAPI）、网络类型(ApnType)、网络变化监听广播以及 Wifi的mac地址。

  官网链接：腾讯浏览服务

  第三方SDK 名称：闪验认证SDK

  用途：一键登录及快速验证用户输入的手机号码和本机流量卡号一致性的服务

  收集个人信息类型：设备名称、机器型号、系统版本、Mac地址、IMEI、ICCID、设备系统版本、运营商类型、网络连接状态

  官网链接：创蓝SDK隐私政策

  第三方SDK 名称：实人认证SDK

  用途：身份认证

  收集个人信息类型：设备信息、最终用户上传的图片信息、终端权限信息

  官网链接：实人认证隐私权政策

  二、CSDN收集信息的使用规则

  2.1 CSDN收集信息可能用于如下用途

  （1）您提供的个人信息将用于登陆及使用产品及服务过程中的身份验证、客户服务、安全防范、存档和备份用途，以确定您身份的唯一性，并保障CSDN向您提供服务的安全性。

  （2）改善CSDN提供产品及服务过程，满足用户个人需求，提升用户体验。例如，收集您的浏览信息、兴趣爱好信息，用于向您推送您感兴趣的资讯、广告，用于为您推荐或提供工作机会。收集您在问卷调查、与平台客服进行沟通过程中的系列信息，提升客户服务体验。

  （3）在法律规定范围内，CSDN可能将本平台收集的信息提供给其他关联方，或将您的信息用于分析设计新产品及服务。

  （4）经您同意的其他用途。

  2.2 CSDN收集信息的使用规则

  （1）CSDN会采取一切合理可行的安全防护措施保护用户信息，防止用户信息遭到未经授权的访问、公开披露、使用、修改、损坏或丢失。

  （2）收集您的个人信息后，CSDN将通过技术手段对数据进行去标识化处理，使您的信息无法被识别主体。您同意个人信息在通过上述处理后，CSDN有权对用户数据库进行分析并予以商业化的利用。

  （3）您同意在未注销账户或进行特别设置的情况下，CSDN在您账户有效期间内按照本隐私政策约定持续使用您的信息。

  （4）CSDN在产品创新以及优化服务过程中，可能会与第三方或公众共享基于您提供信息或授权信息形成的数据，但CSDN不会体现可以识别您身份的信息。

  （5）CSDN使用您的信息时，将采取匿名化、信息替换等脱敏措施保护您的个人隐私及信息安全。

  （6）CSDN在将您的信息用于本隐私政策未列明的用途时，将事先获取您的同意。

  三、CSDN如何共享、转让、公开披露您的个人信息

  3.1我们不会与任何公司、组织和个人共享您的个人信息，但以下情况除外：

  （1）在获取您明确同意的情况下，我们会与合作伙伴及 软件提供商 、 服务提供商 第三方共享您的个人信息的类型(设备信息、地理位置、网络信息)、设备信息:设备标识符（IMEI、IDFA、Android ID、MAC、OAID等相关信息）、应用信息（应用崩溃信息、通知开关状态、软件列表等相关信息）、设备参数及系统信息（设备类型、设备型号、操作系统及硬件相关信息）、网络信息(IP地址，WiFi信息，基站信息等相关信息)个人信息。

  （2）我们可能会根据法律法规规定、诉讼争议解决需要，或按行政、司法机关依法提出的要求，对外共享您的姓名、证件号码、手机号、电子邮箱、IP地址、订单信息、账号密码、财产信息的个人信息。

  （3）为维护CSDN、CSDN的关联方或合作伙伴、您或其他CSDN用户或社会公众利益、财产或安全免遭损害，在法律允许的范围内，共享您的姓名、手机号、电子邮箱个人信息。

  （4）CSDN关联方或旗下其他产品向您提供服务时，我们有权共享您的姓名、证件号码、手机号、电子邮箱个人必要信息，且我们会告知关联方严格遵守本隐私政策的规定。关联方如要改变个人信息目的，应再次获得您的授权同意。

  （5）我们将基于合法、正当、必要、特定、明确的目的，在为您提供服务过程中，可能会向合作伙伴及第三方共享您的 订单信息、账户信息 、 设备信息以及 位置信息 必要个人信息，以保障为您提供的服务顺利完成。

  （6）基于符合法律法规的社会公共利益而使用。

  3.2转让

  我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：

  （1）事先获得您明确的同意或授权。

  （2）根据适用的法律法规、法律程序的要求、强制性的行政或司法要求所必须的情况进行提供。

  （3）符合与您签署的相关协议（包括在线签署的电子协议以及相应的平台规则）或其他的法律文件约定所提供。

  （4）在涉及合并、收购、资产转让或类似的交易时，如涉及到姓名、证件号码、手机号、电子邮箱、IP地址、订单信息、账号密码、财产信息的个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受本隐私政策的约束，否则，我们将要求该公司、组织重新向您征求授权同意。

  3.3公开披露

  （1）您同意或授权CSDN披露的。

  （2）您使用共享功能的。

  （3）根据法律、法规的要求、强制性的行政执法或司法要求所必须提供您个人信息的情况下，CSDN可能会依据所要求的个人信息类型和披露方式公开披露您的姓名、证件号码、手机号、电子邮箱、IP地址、订单信息、账号密码、财产信息的个人信息。在符合法律法规的前提下，当CSDN收到上述披露信息的请求时，我们会要求其必须出具与之相应的法律文件，如调查函等。CSDN将依据审慎原则进行披露，以确保其具备合法依据，且仅限于执法部门因特定调查目的且有合法权利获取的数据。

  （4）符合CSDN相关产品和服务的用户协议或其他类似协议的规定。

  四、CSDN如何使用 Cookie 和同类技术

  4.1为保障网站正常运行，提升用户个人体验，CSDN会通过Cookie技术让网站服务器将数据存储在客户端或从客户端中读取数据。Cookie处理的信息一般均需经过加密，Cookie技术会使您的用户体验得到良好提升。

  4.2使用Cookie的目的主要包括身份验证，保障您登陆账户的安全性；按照您希望的方式对服务方式及个性化选择进行偏好设置；排查产品服务、作弊等行为以及广告优化等方面。

  4.3您可以根据自己的需求，选择删除Cookie，或对Cookie进行管理，但您采取删除等措施时，您之前记录的信息都将被删除，且每登陆一次，均需要更改用户设置，可能会对您使用CSDN服务的安全性、用户体验性产生一定影响。



  五、CSDN如何保护和保存您的个人信息

  5.1存储地点：

  我们依照法律法规的规定，将在境内运营过程中收集和缠上的您的个人信息存储于中华人民共和国境内，目前，我们不会将上述信息传输至境外，如果我们向境外传输，我们将会遵循相关国家规定或者征求您的同意。

  5.2 存储期限

  我们仅在为提供“CSDN”及服务之目的所必需的期间内保留您的个人信息：您发布的信息、评论、点赞及相关信息，在您未撤回、删除或未注销账号期间，我们会保留相关信息。超出必要期限后，我们将对您的个人信息进行删除或匿名化处理，但法律法规另有规定的除外。

  5.3数据安全技术措施

  （1）CSDN会采用符合业界标准的安全防护措施，包括建立合理的制度规范、安全技术来防止您的个人信息遭到未经授权的访问使用、修改、避免数据的损坏或丢失。

  （2）CSDN提供的网络服务采取通过https等方式提供浏览服务，保障用户数据在传输过程中的安全。我们将使用安全技术和程序监测、记录网络运行状态、网络安全事件，并采取必要的技术措施保障网络安全，以防信息的丢失、不当使用、未经授权阅览或披露。

  （3）CSDN将采取严格的数据访问权限控制和多重身份认证技术保护个人信息，避免数据被违法违规使用。

  5.4严格限制接触途径

  CSDN仅允许有必要知晓您个人信息的CSDN及CSDN关联方的员工、合作伙伴访问个人信息，并为此设置了严格的访问权限控制和监控机制。我们同时要求可能接触到您个人信息的所有人员履行相应的保密义务。如果未能履行这些义务，可能会被追究法律责任或被中止与CSDN的合作关系。

  5.5您在使用CSDN的产品和服务时所提供、上传或发布的内容和信息（例如有关您个人的课程内容，活动的照片等信息），可能会泄露您的个人信息，您在使用上述服务过程前，应谨慎的考量是否接受CSDN提供的相关服务。

  5.6互联网并不是绝对安全的网络环境，且电子邮件、即时通讯、社交软件等与其他用户的交流方式无法确定是否完全加密，CSDN建议您使用此类工具时请使用复杂密码，并注意保护您的个人信息安全。

  5.7安全事件处置

  （1）鉴于存在个人信息泄露、毁损以及丢失的风险，CSDN建立了多项安全制度，明确安全事件、安全漏洞的类别等级，并制定了相关的处理流程。同时，CSDN组建了专门的应急响应团队，按照公司有关安全事件处置规范要求，针对不同安全事件启动安全预案，进行止损、分析、制定补救措施、联合相关部门进行溯源和打击。

  （2）如发生安全事件，CSDN将按照法律法规的要求，及时向您告知安全事件的基本情况和可能的影响、已采取或将要采取的处置措施、您可自主防范和降低风险的建议、拟采取的补救措施等。我们还会及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，会采取合理、有效的方式发布公告。同时，还将按照监管部门要求，主动上报个人信息安全事件的处置情况。



  六、您如何管理个人信息

  6.1 CSDN非常重视您对个人信息的保护，并在法律允许的范围内尽全力保护您对个人信息访问、更正、删除以及撤回同意的权利，以使您充分保障您的隐私和安全。您的权利包括：

  （1）访问、修改、删除您的个人信息

  您有权访问、修改、删除您的个人信息，但相关信息的删除或修改可能会影响您对相关产品或服务的使用或导致部分功能的实现，访问、修改、删除的具体途径详见CSDN各产品及服务页面公布内容，或者您可以通过第九条“如何联系我们”进行沟通调整。

  （2）改变您授权同意的范围或撤回您的授权

  您有权改变您授权同意的范围或撤回您的授权；您可以通过删除信息、关闭设备功能、或在相应产品或服务的网站或应用程序“设置”中进行隐私设置，改变您授权CSDN继续收集个人信息的范围或撤回您的授权。您也可以通过注销账户的方式，撤回CSDN继续收集您个人信息的授权。

  （3）注销账户

  您可以通过CSDN的具体产品或服务“设置”中所公布的注销方式或通过第九条所列联系方式申请注销相关账户，我们会根据您的账号安全状态以及产品服务信息，判断您是否满足注销条件。您注销账户后，CSDN将停止为您提供与账号相关的产品或服务功能，并将删除或匿名化处理您的个人信息，除法律法规另有规定或您另有要求外。

  6.2如果您无法访问、修改或删除您的个人信息，或您需要访问、修改或删除您在使用CSDN产品、服务时所产生的其他个人信息，或您认为CSDN存在任何违反法律法规或与您关于个人信息的收集或使用的约定，您可通过第九条所列联系方式与我们联系。



  七、未成年人信息的保护

  7.1 CSDN非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用我们的产品或服务前，应事先取得您家长或法定监护人的书面同意。CSDN将根据未成年人相关法律规定保障其合法权益不受侵害。

  7.2 CSDN鼓励监护人指导未成年人使用CSDN的产品和服务，并建议未成年人鼓励其监护人阅读本政策。

  7.3对于经未成年人父母或法定监护人同意而收集未成年人个人信息的情况，CSDN仅在法律允许的范围内，在获得父母或监护人明确同意或者保护未成年人所必要的情况下使用或公开披露相关信息。



  八、隐私政策的修订和更新

  8.1随着CSDN的不断发展以及不断提升服务质量及产品品质的宗旨，本隐私政策也会随之修订，更新。我们不会在未经您同意的情况下，限制或减少您依据本隐私政策享有的权利。修订、更新后的隐私政策将在CSDN网站、移动客户端上进行公告，或者以其他方式对变更之处进行提示。对于重大变更，我们将通过邮件、短信、在浏览页面做出特别提示等方式进行通知说明。

  8.2若您继续使用CSDN产品和服务，即表示您同意接受修订、更新后隐私政策的约束，否则，请您立即停止使用CSDN相关产品和服务。



  九、如何联系我们

  9.1如您对本隐私政策或您个人信息的相关事宜有任何问题、意见或建议，请拨打电话  400-660-0108 客服电话，或发送邮件至  k efu@csdn.net  与我们进行联系。

  9.2我们将在收到您反馈意见后的  7  个工作日内给予回复。如果您对我们的回复不满意，或认为我们的行为损害了您的合法权益，您还可以向以下部门进行投诉举报：

  投诉举报部门：网信、电信、公安及工商等监管部门

  中央网信办网址： http://www.12377.cn

  举报电话为：12377

  平台运营主体名称：北京创新乐知网络技术有限公司

  注册地址：北京市朝阳区酒仙桥路10号恒通商务园B8B二层

  联系地址：北京市朝阳区酒仙桥路10号恒通商务园B8B二层

  联系电话：400-660-0108

  联系邮箱：kefu@csdn.net

  个人信息保护部门专职邮箱：app@csdn.net
</div>
</template>

<style scoped lang="scss">

</style>